package homeworks.hw9_20230522.task4;

/*
        Уровень сложности 7/10 - Исключения при чтении файла:

        Создайте приложение, которое считывает данные из файла и парсит их в объекты.
        В файле должны быть разные типы данных, которые могут привести к различным типам исключений, например,
        FileNotFoundException, IOException и NumberFormatException.
        Ваша задача - обработать эти исключения и предоставить пользователю понятные сообщения об ошибках,
        а также предпринять соответствующие действия для обработки исключений (например, повторить попытку чтения,
        пропустить неправильные данные и т.д.).
*/

public class Main {
  public static void main(String[] args) {

  }
}
